{
    "header": {
        "name": "Jim Cresswell",
        "title": "Engineering Leader",
        "email": "jim@jimcresswell.net",
        "linkedin": "https://linkedin.com/in/jimcresswell"
    },
    "introductory_summary": [
        "Jim Cresswell is an Engineering Leader with a passion for technical strategy, leadership, and sustainable development. Recognised for his ability to deliver high-quality digital products and impactful solutions, Jim focuses on empowering teams, building resilience, and fostering environments conducive to collaboration and growth.",
        "Jim has driven engineering practices in one of the earliest web apps for a major UK newspaper, enabling development at scale and pace, and was instrumental in instigating a major airline's transition to modern version control practices.",
        "He played a pivotal role in building the Oak National Academy platform, an emergency online fallback school created during the pandemic to support the education of millions. As Oak transitioned to become the national curriculum body for the UK, Jim led the rebuilding of the platform with a focus on long-term stability, innovation, and a smooth development and delivery pipeline.",
        "Jim thrives at the intersection of technology, social impact, and open-source innovation, leveraging his skills to build resilient, scalable, and impactful digital solutions. His research-driven, prototyping approach ensures solutions are effective, sustainable, and aligned with long-term goals."
    ],
    "experience": [
        {
            "company": "Oak National Academy",
            "website": "https://www.thenational.academy/",
            "roles": [
                {
                    "title": "Principal Engineer",
                    "dates": "June 2022 - Present",
                    "description_paragraphs": [
                        "Leading the development of app features, cloud infrastructure, and developer experience at Oak National Academy. Collaborated closely with stakeholders to ensure alignment with organisational needs and technical excellence.",
                        "Responsible for overseeing the overall technical strategy, particularly around product strategy, CI/CD pipelines, cloud infrastructure, and digital transformation. Worked hands-on with technologies like Google Cloud Platform, Vercel, Cloudflare, GitHub, React, and Next.js.",
                        "Contributed to strategic decision-making by providing insights into technology possibilities, digital strategy, and scaling the product to meet growing demand, while focusing on impact, accessibility, and user experience."
                    ]
                },
                {
                    "title": "Head of DevOps and Quality (Consulting)",
                    "dates": "January 2021 - June 2022",
                    "description_paragraphs": [
                        "Led continuous integration and continuous deployment (CI/CD) strategy, testing, and developer experience across Oak National Academy's remote edtech platforms, created in response to the COVID-19 pandemic.",
                        "Managed the integration of cloud services including Google Cloud, Cloudflare, Vercel, BrowserStack, and SonarCloud to support the delivery of high-quality, scalable educational services for students across the UK."
                    ]
                },
                {
                    "title": "Senior Developer (Consulting)",
                    "dates": "August 2020 - December 2020",
                    "description_paragraphs": [
                        "Contributed as a senior developer in building Oak's edtech solutions from inception, working with technologies such as React, Next.js, GraphQL, and various cloud data services.",
                        "Focused on driving code quality improvements, implementing continuous integration and test automation, and advocating for best practices in engineering to facilitate the early growth of Oak's technical infrastructure."
                    ]
                }
            ]
        },
        {
            "company": "Code Science Limited",
            "roles": [
                {
                    "title": "Managing Director",
                    "dates": "February 2018 - Present",
                    "description_paragraphs": [
                        "Providing strategic consulting services to both public and private sectors. Specialised in delivering solutions in cloud computing, web development, and solution-oriented strategies for effective service delivery.",
                        "Focused on open-source development initiatives, sustainable practices, and enabling resilient technical foundations for client projects."
                    ]
                }
            ]
        },
        {
            "company": "Obaith",
            "website": "https://web.archive.org/web/20211114073948/https://www.obaith.com/",
            "roles": [
                {
                    "title": "Founder",
                    "dates": "January 2018 - December 2020",
                    "description_paragraphs": [
                        "Led a 'tech for good' initiative aiming to explore how digital services could positively influence climate breakdown, biodiversity loss, and social connection. The project focused on community-driven networks and leveraged bottom-up initiatives to address global challenges.",
                        "Conducted extensive research into systems change and identified leverage points for impact. Built networks and consolidated findings for future projects targeting local and scalable ecological solutions."
                    ]
                }
            ]
        },
        {
            "company": "The Home Office",
            "website": "https://www.gov.uk/apply-renew-passport",
            "roles": [
                {
                    "title": "Programme QA Consultant",
                    "dates": "February 2017 - December 2017",
                    "description_paragraphs": [
                        "Developed and implemented a QA automation strategy across an agile program involving multiple projects and scrum teams, creating a micro-service architecture for a public-facing web service.",
                        "Coached development teams in human-readable test specifications (BDD) using technologies like Cucumber, JavaScript, Java, and WebDriver to foster a culture of quality and automation.",
                        "Facilitated collaboration across multiple stakeholders, including architects and programme leads, to drive rapid feedback cycles and continuous improvement in software validation and testing."
                    ]
                }
            ]
        },
        {
            "company": "FT Labs (Financial Times)",
            "website": "http://labs.ft.com/",
            "roles": [
                {
                    "title": "Senior Developer",
                    "dates": "August 2011 - July 2014",
                    "description_paragraphs": [
                        "Worked as a web developer during FT Labs' transition from startup Assanka to the Financial Times. Contributed to the award-winning HTML5-based FT web app.",
                        "Led QA automation, introducing end-to-end testing using WebDriver (Java) and Jenkins, with an emphasis on continuous integration and release velocity.",
                        "Served as the technical lead for projects such as the FT Windows 8 app and experimental projects like the FT FirefoxOS app, liaising between product management and technical teams."
                    ]
                }
            ]
        }
    ],
    "education": [
        {
            "institution": "University of Portsmouth",
            "degree": "Doctor of Philosophy (PhD), Cosmology and Gravitation",
            "dates": "September 2005 - December 2010",
            "thesis": {
                "title": "Luminosity Functions and Galaxy Bias in the Sloan Digital Sky Survey",
                "link": "https://www.semanticscholar.org/paper/Luminosity-functions-and-galaxy-bias-in-the-Sloan-Cresswell/f4e7199fef9e73fad0deec60ae2460fbfc2fedb6"
            }
        },
        {
            "institution": "Sussex University",
            "degree": "Master of Science (M.Sc.), Cosmology",
            "dates": "2004 - 2005",
            "thesis": {
                "title": "Observing Cosmological Topology",
                "link": "http://en.wikipedia.org/wiki/Shape_of_the_universe"
            }
        },
        {
            "institution": "University of Bath",
            "degree": "Master of Physics (M.Phys.), Physics",
            "dates": "1998 - 2002",
            "thesis": {
                "title": "The Design and Construction of a Theremin",
                "link": "https://en.wikipedia.org/wiki/L%C3%A9on_Theremin"
            }
        }
    ],
    "skills": [
        "Technical Leadership",
        "Engineering Strategy",
        "Communication",
        "Developer Experience",
        "Systems Thinking",
        "Product Strategy",
        "System Architecture",
        "Agile Methodologies",
        "Cloud Computing",
        "Google Cloud Platform (GCP)",
        "JavaScript",
        "Typescript",
        "Node",
        "React",
        "Next.js",
        "APIs",
        "GraphQL",
        "PostgreSQL",
        "CI/CD",
        "DevOps",
        "Linux",
        "Quality Assurance"
    ],
    "interests": [
        "Jim is passionate about climate and nature resilience and restoration. At home and on his allotment, Jim grows food using ecology-driven approaches based on up-to-date science, focusing on healthy, living soil, system diversity, and eliminating artificial inputs and pesticides. He has been selecting several new plant cultivars suited for the local climate. Jim has also volunteered at community-driven food initiatives to foster sustainable food systems and support local resilience.",
        "Driving systemic change for sustainability, regeneration, and resilience is of great importance to Jim. He has explored these topics through projects like Obaith and Reforest Now, achieving tangible impact through his contributions at Oak National Academy."
    ]
}